imudak/RL78Sample/Can/iodefine.h
#define RMDF31       (*(volatile __near unsigned short *)0x3BE)
#define GAFLMH2L     (*(volatile __near unsigned char  *)0x3BE)
#define RMDF31L      (*(volatile __near unsigned char  *)0x3BE)
#define GAFLMH2H     (*(volatile __near unsigned char  *)0x3BF)
#define RMDF31H      (*(volatile __near unsigned char  *)0x3BF)
#define GAFLPL2      (*(volatile __near unsigned short *)0x3C0)
#define RMIDL2       (*(volatile __near unsigned short *)0x3C0)
#define GAFLPL2L     (*(volatile __near unsigned char  *)0x3C0)
#define RMIDL2L      (*(volatile __near unsigned char  *)0x3C0)
#define GAFLPL2H     (*(volatile __near unsigned char  *)0x3C1)
#define RMIDL2H      (*(volatile __near unsigned char  *)0x3C1)
#define GAFLPH2      (*(volatile __near unsigned short *)0x3C2)
#define RMIDH2       (*(volatile __near unsigned short *)0x3C2)
#define GAFLPH2L     (*(volatile __near unsigned char  *)0x3C2)
#define RMIDH2L      (*(volatile __near unsigned char  *)0x3C2)
#define GAFLPH2H     (*(volatile __near unsigned char  *)0x3C3)
#define RMIDH2H      (*(volatile __near unsigned char  *)0x3C3)
#define GAFLIDL3     (*(volatile __near unsigned short *)0x3C4)
#define RMTS2        (*(volatile __near unsigned short *)0x3C4)
#define GAFLIDL3L    (*(volatile __near unsigned char  *)0x3C4)
#define RMTS2L       (*(volatile __near unsigned char  *)0x3C4)
#define GAFLIDL3H    (*(volatile __near unsigned char  *)0x3C5)
#define RMTS2H       (*(volatile __near unsigned char  *)0x3C5)
#define GAFLIDH3     (*(volatile __near unsigned short *)0x3C6)
#define RMPTR2       (*(volatile __near unsigned short *)0x3C6)
#define GAFLIDH3L    (*(volatile __near unsigned char  *)0x3C6)
#define RMPTR2L      (*(volatile __near unsigned char  *)0x3C6)
#define GAFLIDH3H    (*(volatile __near unsigned char  *)0x3C7)
#define RMPTR2H      (*(volatile __near unsigned char  *)0x3C7)
#define GAFLML3      (*(volatile __near unsigned short *)0x3C8)
#define RMDF02       (*(volatile __near unsigned short *)0x3C8)
#define GAFLML3L     (*(volatile __near unsigned char  *)0x3C8)
#define RMDF02L      (*(volatile __near unsigned char  *)0x3C8)
#define GAFLML3H     (*(volatile __near unsigned char  *)0x3C9)
#define RMDF02H      (*(volatile __near unsigned char  *)0x3C9)
#define GAFLMH3      (*(volatile __near unsigned short *)0x3CA)
#define RMDF12       (*(volatile __near unsigned short *)0x3CA)
#define GAFLMH3L     (*(volatile __near unsigned char  *)0x3CA)
#define RMDF12L      (*(volatile __near unsigned char  *)0x3CA)
#define GAFLMH3H     (*(volatile __near unsigned char  *)0x3CB)
#define RMDF12H      (*(volatile __near unsigned char  *)0x3CB)
#define GAFLPL3      (*(volatile __near unsigned short *)0x3CC)
#define RMDF22       (*(volatile __near unsigned short *)0x3CC)
#define GAFLPL3L     (*(volatile __near unsigned char  *)0x3CC)
#define RMDF22L      (*(volatile __near unsigned char  *)0x3CC)
#define GAFLPL3H     (*(volatile __near unsigned char  *)0x3CD)
#define RMDF22H      (*(volatile __near unsigned char  *)0x3CD)
#define GAFLPH3      (*(volatile __near unsigned short *)0x3CE)
#define RMDF32       (*(volatile __near unsigned short *)0x3CE)
#define GAFLPH3L     (*(volatile __near unsigned char  *)0x3CE)
#define RMDF32L      (*(volatile __near unsigned char  *)0x3CE)
#define GAFLPH3H     (*(volatile __near unsigned char  *)0x3CF)
#define RMDF32H      (*(volatile __near unsigned char  *)0x3CF)
#define GAFLIDL4     (*(volatile __near unsigned short *)0x3D0)
#define RMIDL3       (*(volatile __near unsigned short *)0x3D0)
#define GAFLIDL4L    (*(volatile __near unsigned char  *)0x3D0)
#define RMIDL3L      (*(volatile __near unsigned char  *)0x3D0)
#define GAFLIDL4H    (*(volatile __near unsigned char  *)0x3D1)
#define RMIDL3H      (*(volatile __near unsigned char  *)0x3D1)
#define GAFLIDH4     (*(volatile __near unsigned short *)0x3D2)
#define RMIDH3       (*(volatile __near unsigned short *)0x3D2)
#define GAFLIDH4L    (*(volatile __near unsigned char  *)0x3D2)
#define RMIDH3L      (*(volatile __near unsigned char  *)0x3D2)
#define GAFLIDH4H    (*(volatile __near unsigned char  *)0x3D3)
#define RMIDH3H      (*(volatile __near unsigned char  *)0x3D3)
#define GAFLML4      (*(volatile __near unsigned short *)0x3D4)
#define RMTS3        (*(volatile __near unsigned short *)0x3D4)
#define GAFLML4L     (*(volatile __near unsigned char  *)0x3D4)
#define RMTS3L       (*(volatile __near unsigned char  *)0x3D4)
#define GAFLML4H     (*(volatile __near unsigned char  *)0x3D5)
#define RMTS3H       (*(volatile __near unsigned char  *)0x3D5)
#define GAFLMH4      (*(volatile __near unsigned short *)0x3D6)
#define RMPTR3       (*(volatile __near unsigned short *)0x3D6)
#define GAFLMH4L     (*(volatile __near unsigned char  *)0x3D6)
#define RMPTR3L      (*(volatile __near unsigned char  *)0x3D6)
#define GAFLMH4H     (*(volatile __near unsigned char  *)0x3D7)
#define RMPTR3H      (*(volatile __near unsigned char  *)0x3D7)
#define GAFLPL4      (*(volatile __near unsigned short *)0x3D8)
#define RMDF03       (*(volatile __near unsigned short *)0x3D8)
#define GAFLPL4L     (*(volatile __near unsigned char  *)0x3D8)
#define RMDF03L      (*(volatile __near unsigned char  *)0x3D8)
#define GAFLPL4H     (*(volatile __near unsigned char  *)0x3D9)
#define RMDF03H      (*(volatile __near unsigned char  *)0x3D9)
#define GAFLPH4      (*(volatile __near unsigned short *)0x3DA)
#define RMDF13       (*(volatile __near unsigned short *)0x3DA)
#define GAFLPH4L     (*(volatile __near unsigned char  *)0x3DA)
#define RMDF13L      (*(volatile __near unsigned char  *)0x3DA)
#define GAFLPH4H     (*(volatile __near unsigned char  *)0x3DB)
#define RMDF13H      (*(volatile __near unsigned char  *)0x3DB)
#define GAFLIDL5     (*(volatile __near unsigned short *)0x3DC)
#define RMDF23       (*(volatile __near unsigned short *)0x3DC)
#define GAFLIDL5L    (*(volatile __near unsigned char  *)0x3DC)
#define RMDF23L      (*(volatile __near unsigned char  *)0x3DC)
#define GAFLIDL5H    (*(volatile __near unsigned char  *)0x3DD)
#define RMDF23H      (*(volatile __near unsigned char  *)0x3DD)
#define GAFLIDH5     (*(volatile __near unsigned short *)0x3DE)
#define RMDF33       (*(volatile __near unsigned short *)0x3DE)
#define GAFLIDH5L    (*(volatile __near unsigned char  *)0x3DE)
#define RMDF33L      (*(volatile __near unsigned char  *)0x3DE)
#define GAFLIDH5H    (*(volatile __near unsigned char  *)0x3DF)
#define RMDF33H      (*(volatile __near unsigned char  *)0x3DF)
#define GAFLML5      (*(volatile __near unsigned short *)0x3E0)
#define RMIDL4       (*(volatile __near unsigned short *)0x3E0)
#define GAFLML5L     (*(volatile __near unsigned char  *)0x3E0)
#define RMIDL4L      (*(volatile __near unsigned char  *)0x3E0)
#define GAFLML5H     (*(volatile __near unsigned char  *)0x3E1)
#define RMIDL4H      (*(volatile __near unsigned char  *)0x3E1)
#define GAFLMH5      (*(volatile __near unsigned short *)0x3E2)
#define RMIDH4       (*(volatile __near unsigned short *)0x3E2)
#define GAFLMH5L     (*(volatile __near unsigned char  *)0x3E2)
#define RMIDH4L      (*(volatile __near unsigned char  *)0x3E2)
#define GAFLMH5H     (*(volatile __near unsigned char  *)0x3E3)
#define RMIDH4H      (*(volatile __near unsigned char  *)0x3E3)
#define GAFLPL5      (*(volatile __near unsigned short *)0x3E4)
#define RMTS4        (*(volatile __near unsigned short *)0x3E4)
#define GAFLPL5L     (*(volatile __near unsigned char  *)0x3E4)
#define RMTS4L       (*(volatile __near unsigned char  *)0x3E4)
#define GAFLPL5H     (*(volatile __near unsigned char  *)0x3E5)
#define RMTS4H       (*(volatile __near unsigned char  *)0x3E5)
#define GAFLPH5      (*(volatile __near unsigned short *)0x3E6)
#define RMPTR4       (*(volatile __near unsigned short *)0x3E6)
#define GAFLPH5L     (*(volatile __near unsigned char  *)0x3E6)
#define RMPTR4L      (*(volatile __near unsigned char  *)0x3E6)
#define GAFLPH5H     (*(volatile __near unsigned char  *)0x3E7)
#define RMPTR4H      (*(volatile __near unsigned char  *)0x3E7)
#define GAFLIDL6     (*(volatile __near unsigned short *)0x3E8)
#define RMDF04       (*(volatile __near unsigned short *)0x3E8)
#define GAFLIDL6L    (*(volatile __near unsigned char  *)0x3E8)
#define RMDF04L      (*(volatile __near unsigned char  *)0x3E8)
#define GAFLIDL6H    (*(volatile __near unsigned char  *)0x3E9)
#define RMDF04H      (*(volatile __near unsigned char  *)0x3E9)
#define GAFLIDH6     (*(volatile __near unsigned short *)0x3EA)
#define RMDF14       (*(volatile __near unsigned short *)0x3EA)
#define GAFLIDH6L    (*(volatile __near unsigned char  *)0x3EA)
#define RMDF14L      (*(volatile __near unsigned char  *)0x3EA)
#define GAFLIDH6H    (*(volatile __near unsigned char  *)0x3EB)
#define RMDF14H      (*(volatile __near unsigned char  *)0x3EB)
#define GAFLML6      (*(volatile __near unsigned short *)0x3EC)
#define RMDF24       (*(volatile __near unsigned short *)0x3EC)
#define GAFLML6L     (*(volatile __near unsigned char  *)0x3EC)
#define RMDF24L      (*(volatile __near unsigned char  *)0x3EC)
#define GAFLML6H     (*(volatile __near unsigned char  *)0x3ED)
#define RMDF24H      (*(volatile __near unsigned char  *)0x3ED)
#define GAFLMH6      (*(volatile __near unsigned short *)0x3EE)
#define RMDF34       (*(volatile __near unsigned short *)0x3EE)
#define GAFLMH6L     (*(volatile __near unsigned char  *)0x3EE)
#define RMDF34L      (*(volatile __near unsigned char  *)0x3EE)
#define GAFLMH6H     (*(volatile __near unsigned char  *)0x3EF)
#define RMDF34H      (*(volatile __near unsigned char  *)0x3EF)
#define GAFLPL6      (*(volatile __near unsigned short *)0x3F0)
#define RMIDL5       (*(volatile __near unsigned short *)0x3F0)
#define GAFLPL6L     (*(volatile __near unsigned char  *)0x3F0)
#define RMIDL5L      (*(volatile __near unsigned char  *)0x3F0)
#define GAFLPL6H     (*(volatile __near unsigned char  *)0x3F1)
#define RMIDL5H      (*(volatile __near unsigned char  *)0x3F1)
#define GAFLPH6      (*(volatile __near unsigned short *)0x3F2)
#define RMIDH5       (*(volatile __near unsigned short *)0x3F2)
#define GAFLPH6L     (*(volatile __near unsigned char  *)0x3F2)
#define RMIDH5L      (*(volatile __near unsigned char  *)0x3F2)
#define GAFLPH6H     (*(volatile __near unsigned char  *)0x3F3)
#define RMIDH5H      (*(volatile __near unsigned char  *)0x3F3)
#define GAFLIDL7     (*(volatile __near unsigned short *)0x3F4)
#define RMTS5        (*(volatile __near unsigned short *)0x3F4)
#define GAFLIDL7L    (*(volatile __near unsigned char  *)0x3F4)
#define RMTS5L       (*(volatile __near unsigned char  *)0x3F4)
#define GAFLIDL7H    (*(volatile __near unsigned char  *)0x3F5)
#define RMTS5H       (*(volatile __near unsigned char  *)0x3F5)
#define GAFLIDH7     (*(volatile __near unsigned short *)0x3F6)
#define RMPTR5       (*(volatile __near unsigned short *)0x3F6)
#define GAFLIDH7L    (*(volatile __near unsigned char  *)0x3F6)
#define RMPTR5L      (*(volatile __near unsigned char  *)0x3F6)
#define GAFLIDH7H    (*(volatile __near unsigned char  *)0x3F7)
#define RMPTR5H      (*(volatile __near unsigned char  *)0x3F7)
#define GAFLML7      (*(volatile __near unsigned short *)0x3F8)
#define RMDF05       (*(volatile __near unsigned short *)0x3F8)
#define GAFLML7L     (*(volatile __near unsigned char  *)0x3F8)
#define RMDF05L      (*(volatile __near unsigned char  *)0x3F8)
#define GAFLML7H     (*(volatile __near unsigned char  *)0x3F9)
#define RMDF05H      (*(volatile __near unsigned char  *)0x3F9)
#define GAFLMH7      (*(volatile __near unsigned short *)0x3FA)
#define RMDF15       (*(volatile __near unsigned short *)0x3FA)
#define GAFLMH7L     (*(volatile __near unsigned char  *)0x3FA)
#define RMDF15L      (*(volatile __near unsigned char  *)0x3FA)
#define GAFLMH7H     (*(volatile __near unsigned char  *)0x3FB)
#define RMDF15H      (*(volatile __near unsigned char  *)0x3FB)
#define GAFLPL7      (*(volatile __near unsigned short *)0x3FC)
#define RMDF25       (*(volatile __near unsigned short *)0x3FC)
#define GAFLPL7L     (*(volatile __near unsigned char  *)0x3FC)
#define RMDF25L      (*(volatile __near unsigned char  *)0x3FC)
#define GAFLPL7H     (*(volatile __near unsigned char  *)0x3FD)
#define RMDF25H      (*(volatile __near unsigned char  *)0x3FD)
#define GAFLPH7      (*(volatile __near unsigned short *)0x3FE)
#define RMDF35       (*(volatile __near unsigned short *)0x3FE)
#define GAFLPH7L     (*(volatile __near unsigned char  *)0x3FE)
#define RMDF35L      (*(volatile __near unsigned char  *)0x3FE)
#define GAFLPH7H     (*(volatile __near unsigned char  *)0x3FF)
#define RMDF35H      (*(volatile __near unsigned char  *)0x3FF)
#define GAFLIDL8     (*(volatile __near unsigned short *)0x400)
#define RMIDL6       (*(volatile __near unsigned short *)0x400)
#define GAFLIDL8L    (*(volatile __near unsigned char  *)0x400)
#define RMIDL6L      (*(volatile __near unsigned char  *)0x400)
#define GAFLIDL8H    (*(volatile __near unsigned char  *)0x401)
#define RMIDL6H      (*(volatile __near unsigned char  *)0x401)
#define GAFLIDH8     (*(volatile __near unsigned short *)0x402)
#define RMIDH6       (*(volatile __near unsigned short *)0x402)
#define GAFLIDH8L    (*(volatile __near unsigned char  *)0x402)
#define RMIDH6L      (*(volatile __near unsigned char  *)0x402)
#define GAFLIDH8H    (*(volatile __near unsigned char  *)0x403)
#define RMIDH6H      (*(volatile __near unsigned char  *)0x403)
#define GAFLML8      (*(volatile __near unsigned short *)0x404)
#define RMTS6        (*(volatile __near unsigned short *)0x404)
#define GAFLML8L     (*(volatile __near unsigned char  *)0x404)
#define RMTS6L       (*(volatile __near unsigned char  *)0x404)
#define GAFLML8H     (*(volatile __near unsigned char  *)0x405)
#define RMTS6H       (*(volatile __near unsigned char  *)0x405)
#define GAFLMH8      (*(volatile __near unsigned short *)0x406)
#define RMPTR6       (*(volatile __near unsigned short *)0x406)
#define GAFLMH8L     (*(volatile __near unsigned char  *)0x406)
#define RMPTR6L      (*(volatile __near unsigned char  *)0x406)
#define GAFLMH8H     (*(volatile __near unsigned char  *)0x407)
#define RMPTR6H      (*(volatile __near unsigned char  *)0x407)
#define GAFLPL8      (*(volatile __near unsigned short *)0x408)
#define RMDF06       (*(volatile __near unsigned short *)0x408)
#define GAFLPL8L     (*(volatile __near unsigned char  *)0x408)
#define RMDF06L      (*(volatile __near unsigned char  *)0x408)
#define GAFLPL8H     (*(volatile __near unsigned char  *)0x409)
#define RMDF06H      (*(volatile __near unsigned char  *)0x409)
#define GAFLPH8      (*(volatile __near unsigned short *)0x40A)
#define RMDF16       (*(volatile __near unsigned short *)0x40A)
#define GAFLPH8L     (*(volatile __near unsigned char  *)0x40A)
#define RMDF16L      (*(volatile __near unsigned char  *)0x40A)
#define GAFLPH8H     (*(volatile __near unsigned char  *)0x40B)
#define RMDF16H      (*(volatile __near unsigned char  *)0x40B)
#define GAFLIDL9     (*(volatile __near unsigned short *)0x40C)
#define RMDF26       (*(volatile __near unsigned short *)0x40C)
#define GAFLIDL9L    (*(volatile __near unsigned char  *)0x40C)
#define RMDF26L      (*(volatile __near unsigned char  *)0x40C)
#define GAFLIDL9H    (*(volatile __near unsigned char  *)0x40D)
#define RMDF26H      (*(volatile __near unsigned char  *)0x40D)
#define GAFLIDH9     (*(volatile __near unsigned short *)0x40E)
#define RMDF36       (*(volatile __near unsigned short *)0x40E)
#define GAFLIDH9L    (*(volatile __near unsigned char  *)0x40E)
#define RMDF36L      (*(volatile __near unsigned char  *)0x40E)
#define GAFLIDH9H    (*(volatile __near unsigned char  *)0x40F)
#define RMDF36H      (*(volatile __near unsigned char  *)0x40F)
#define GAFLML9      (*(volatile __near unsigned short *)0x410)
#define RMIDL7       (*(volatile __near unsigned short *)0x410)
#define GAFLML9L     (*(volatile __near unsigned char  *)0x410)
#define RMIDL7L      (*(volatile __near unsigned char  *)0x410)
#define GAFLML9H     (*(volatile __near unsigned char  *)0x411)
#define RMIDL7H      (*(volatile __near unsigned char  *)0x411)
#define GAFLMH9      (*(volatile __near unsigned short *)0x412)
#define RMIDH7       (*(volatile __near unsigned short *)0x412)
#define GAFLMH9L     (*(volatile __near unsigned char  *)0x412)
#define RMIDH7L      (*(volatile __near unsigned char  *)0x412)
#define GAFLMH9H     (*(volatile __near unsigned char  *)0x413)
#define RMIDH7H      (*(volatile __near unsigned char  *)0x413)
#define GAFLPL9      (*(volatile __near unsigned short *)0x414)
#define RMTS7        (*(volatile __near unsigned short *)0x414)
#define GAFLPL9L     (*(volatile __near unsigned char  *)0x414)
#define RMTS7L       (*(volatile __near unsigned char  *)0x414)
#define GAFLPL9H     (*(volatile __near unsigned char  *)0x415)
#define RMTS7H       (*(volatile __near unsigned char  *)0x415)
#define GAFLPH9      (*(volatile __near unsigned short *)0x416)
#define RMPTR7       (*(volatile __near unsigned short *)0x416)
#define GAFLPH9L     (*(volatile __near unsigned char  *)0x416)
#define RMPTR7L      (*(volatile __near unsigned char  *)0x416)
#define GAFLPH9H     (*(volatile __near unsigned char  *)0x417)
#define RMPTR7H      (*(volatile __near unsigned char  *)0x417)
#define GAFLIDL10    (*(volatile __near unsigned short *)0x418)
#define RMDF07       (*(volatile __near unsigned short *)0x418)
#define GAFLIDL10L   (*(volatile __near unsigned char  *)0x418)
#define RMDF07L      (*(volatile __near unsigned char  *)0x418)
#define GAFLIDL10H   (*(volatile __near unsigned char  *)0x419)
#define RMDF07H      (*(volatile __near unsigned char  *)0x419)
#define GAFLIDH10    (*(volatile __near unsigned short *)0x41A)
#define RMDF17       (*(volatile __near unsigned short *)0x41A)
#define GAFLIDH10L   (*(volatile __near unsigned char  *)0x41A)
#define RMDF17L      (*(volatile __near unsigned char  *)0x41A)
#define GAFLIDH10H   (*(volatile __near unsigned char  *)0x41B)
#define RMDF17H      (*(volatile __near unsigned char  *)0x41B)
#define GAFLML10     (*(volatile __near unsigned short *)0x41C)
#define RMDF27       (*(volatile __near unsigned short *)0x41C)
#define GAFLML10L    (*(volatile __near unsigned char  *)0x41C)
#define RMDF27L      (*(volatile __near unsigned char  *)0x41C)
#define GAFLML10H    (*(volatile __near unsigned char  *)0x41D)
#define RMDF27H      (*(volatile __near unsigned char  *)0x41D)
#define GAFLMH10     (*(volatile __near unsigned short *)0x41E)
#define RMDF37       (*(volatile __near unsigned short *)0x41E)
#define GAFLMH10L    (*(volatile __near unsigned char  *)0x41E)
#define RMDF37L      (*(volatile __near unsigned char  *)0x41E)
#define GAFLMH10H    (*(volatile __near unsigned char  *)0x41F)
#define RMDF37H      (*(volatile __near unsigned char  *)0x41F)
#define GAFLPL10     (*(volatile __near unsigned short *)0x420)
#define RMIDL8       (*(volatile __near unsigned short *)0x420)
#define GAFLPL10L    (*(volatile __near unsigned char  *)0x420)
#define RMIDL8L      (*(volatile __near unsigned char  *)0x420)
#define GAFLPL10H    (*(volatile __near unsigned char  *)0x421)
#define RMIDL8H      (*(volatile __near unsigned char  *)0x421)
#define GAFLPH10     (*(volatile __near unsigned short *)0x422)
#define RMIDH8       (*(volatile __near unsigned short *)0x422)
#define GAFLPH10L    (*(volatile __near unsigned char  *)0x422)
#define RMIDH8L      (*(volatile __near unsigned char  *)0x422)
#define GAFLPH10H    (*(volatile __near unsigned char  *)0x423)
#define RMIDH8H      (*(volatile __near unsigned char  *)0x423)
#define GAFLIDL11    (*(volatile __near unsigned short *)0x424)
#define RMTS8        (*(volatile __near unsigned short *)0x424)
#define GAFLIDL11L   (*(volatile __near unsigned char  *)0x424)
#define RMTS8L       (*(volatile __near unsigned char  *)0x424)
#define GAFLIDL11H   (*(volatile __near unsigned char  *)0x425)
#define RMTS8H       (*(volatile __near unsigned char  *)0x425)
#define GAFLIDH11    (*(volatile __near unsigned short *)0x426)
#define RMPTR8       (*(volatile __near unsigned short *)0x426)
#define GAFLIDH11L   (*(volatile __near unsigned char  *)0x426)
#define RMPTR8L      (*(volatile __near unsigned char  *)0x426)
#define GAFLIDH11H   (*(volatile __near unsigned char  *)0x427)
#define RMPTR8H      (*(volatile __near unsigned char  *)0x427)
#define GAFLML11     (*(volatile __near unsigned short *)0x428)
#define RMDF08       (*(volatile __near unsigned short *)0x428)
#define GAFLML11L    (*(volatile __near unsigned char  *)0x428)
#define RMDF08L      (*(volatile __near unsigned char  *)0x428)
#define GAFLML11H    (*(volatile __near unsigned char  *)0x429)
#define RMDF08H      (*(volatile __near unsigned char  *)0x429)
#define GAFLMH11     (*(volatile __near unsigned short *)0x42A)
#define RMDF18       (*(volatile __near unsigned short *)0x42A)
#define GAFLMH11L    (*(volatile __near unsigned char  *)0x42A)
#define RMDF18L      (*(volatile __near unsigned char  *)0x42A)
#define GAFLMH11H    (*(volatile __near unsigned char  *)0x42B)
#define RMDF18H      (*(volatile __near unsigned char  *)0x42B)
#define GAFLPL11     (*(volatile __near unsigned short *)0x42C)
#define RMDF28       (*(volatile __near unsigned short *)0x42C)
#define GAFLPL11L    (*(volatile __near unsigned char  *)0x42C)
#define RMDF28L      (*(volatile __near unsigned char  *)0x42C)
#define GAFLPL11H    (*(volatile __near unsigned char  *)0x42D)
#define RMDF28H      (*(volatile __near unsigned char  *)0x42D)
#define GAFLPH11     (*(volatile __near unsigned short *)0x42E)
#define RMDF38       (*(volatile __near unsigned short *)0x42E)
#define GAFLPH11L    (*(volatile __near unsigned char  *)0x42E)
#define RMDF38L      (*(volatile __near unsigned char  *)0x42E)
#define GAFLPH11H    (*(volatile __near unsigned char  *)0x42F)
#define RMDF38H      (*(volatile __near unsigned char  *)0x42F)
#define GAFLIDL12    (*(volatile __near unsigned short *)0x430)
#define RMIDL9       (*(volatile __near unsigned short *)0x430)
#define GAFLIDL12L   (*(volatile __near unsigned char  *)0x430)
#define RMIDL9L      (*(volatile __near unsigned char  *)0x430)
#define GAFLIDL12H   (*(volatile __near unsigned char  *)0x431)
#define RMIDL9H      (*(volatile __near unsigned char  *)0x431)
#define GAFLIDH12    (*(volatile __near unsigned short *)0x432)
#define RMIDH9       (*(volatile __near unsigned short *)0x432)
#define GAFLIDH12L   (*(volatile __near unsigned char  *)0x432)
#define RMIDH9L      (*(volatile __near unsigned char  *)0x432)
#define GAFLIDH12H   (*(volatile __near unsigned char  *)0x433)
#define RMIDH9H      (*(volatile __near unsigned char  *)0x433)
#define GAFLML12     (*(volatile __near unsigned short *)0x434)
#define RMTS9        (*(volatile __near unsigned short *)0x434)
#define GAFLML12L    (*(volatile __near unsigned char  *)0x434)
#define RMTS9L       (*(volatile __near unsigned char  *)0x434)
#define GAFLML12H    (*(volatile __near unsigned char  *)0x435)
#define RMTS9H       (*(volatile __near unsigned char  *)0x435)
#define GAFLMH12     (*(volatile __near unsigned short *)0x436)
#define RMPTR9       (*(volatile __near unsigned short *)0x436)
#define GAFLMH12L    (*(volatile __near unsigned char  *)0x436)
#define RMPTR9L      (*(volatile __near unsigned char  *)0x436)
#define GAFLMH12H    (*(volatile __near unsigned char  *)0x437)
#define RMPTR9H      (*(volatile __near unsigned char  *)0x437)
#define GAFLPL12     (*(volatile __near unsigned short *)0x438)
#define RMDF09       (*(volatile __near unsigned short *)0x438)
#define GAFLPL12L    (*(volatile __near unsigned char  *)0x438)
#define RMDF09L      (*(volatile __near unsigned char  *)0x438)
#define GAFLPL12H    (*(volatile __near unsigned char  *)0x439)
#define RMDF09H      (*(volatile __near unsigned char  *)0x439)
#define GAFLPH12     (*(volatile __near unsigned short *)0x43A)
#define RMDF19       (*(volatile __near unsigned short *)0x43A)
#define GAFLPH12L    (*(volatile __near unsigned char  *)0x43A)
#define RMDF19L      (*(volatile __near unsigned char  *)0x43A)
