imudak/RL78Sample/Can/iodefine.h
#define GAFLPH12H    (*(volatile __near unsigned char  *)0x43B)
#define RMDF19H      (*(volatile __near unsigned char  *)0x43B)
#define GAFLIDL13    (*(volatile __near unsigned short *)0x43C)
#define RMDF29       (*(volatile __near unsigned short *)0x43C)
#define GAFLIDL13L   (*(volatile __near unsigned char  *)0x43C)
#define RMDF29L      (*(volatile __near unsigned char  *)0x43C)
#define GAFLIDL13H   (*(volatile __near unsigned char  *)0x43D)
#define RMDF29H      (*(volatile __near unsigned char  *)0x43D)
#define GAFLIDH13    (*(volatile __near unsigned short *)0x43E)
#define RMDF39       (*(volatile __near unsigned short *)0x43E)
#define GAFLIDH13L   (*(volatile __near unsigned char  *)0x43E)
#define RMDF39L      (*(volatile __near unsigned char  *)0x43E)
#define GAFLIDH13H   (*(volatile __near unsigned char  *)0x43F)
#define RMDF39H      (*(volatile __near unsigned char  *)0x43F)
#define GAFLML13     (*(volatile __near unsigned short *)0x440)
#define RMIDL10      (*(volatile __near unsigned short *)0x440)
#define GAFLML13L    (*(volatile __near unsigned char  *)0x440)
#define RMIDL10L     (*(volatile __near unsigned char  *)0x440)
#define GAFLML13H    (*(volatile __near unsigned char  *)0x441)
#define RMIDL10H     (*(volatile __near unsigned char  *)0x441)
#define GAFLMH13     (*(volatile __near unsigned short *)0x442)
#define RMIDH10      (*(volatile __near unsigned short *)0x442)
#define GAFLMH13L    (*(volatile __near unsigned char  *)0x442)
#define RMIDH10L     (*(volatile __near unsigned char  *)0x442)
#define GAFLMH13H    (*(volatile __near unsigned char  *)0x443)
#define RMIDH10H     (*(volatile __near unsigned char  *)0x443)
#define GAFLPL13     (*(volatile __near unsigned short *)0x444)
#define RMTS10       (*(volatile __near unsigned short *)0x444)
#define GAFLPL13L    (*(volatile __near unsigned char  *)0x444)
#define RMTS10L      (*(volatile __near unsigned char  *)0x444)
#define GAFLPL13H    (*(volatile __near unsigned char  *)0x445)
#define RMTS10H      (*(volatile __near unsigned char  *)0x445)
#define GAFLPH13     (*(volatile __near unsigned short *)0x446)
#define RMPTR10      (*(volatile __near unsigned short *)0x446)
#define GAFLPH13L    (*(volatile __near unsigned char  *)0x446)
#define RMPTR10L     (*(volatile __near unsigned char  *)0x446)
#define GAFLPH13H    (*(volatile __near unsigned char  *)0x447)
#define RMPTR10H     (*(volatile __near unsigned char  *)0x447)
#define GAFLIDL14    (*(volatile __near unsigned short *)0x448)
#define RMDF010      (*(volatile __near unsigned short *)0x448)
#define GAFLIDL14L   (*(volatile __near unsigned char  *)0x448)
#define RMDF010L     (*(volatile __near unsigned char  *)0x448)
#define GAFLIDL14H   (*(volatile __near unsigned char  *)0x449)
#define RMDF010H     (*(volatile __near unsigned char  *)0x449)
#define GAFLIDH14    (*(volatile __near unsigned short *)0x44A)
#define RMDF110      (*(volatile __near unsigned short *)0x44A)
#define GAFLIDH14L   (*(volatile __near unsigned char  *)0x44A)
#define RMDF110L     (*(volatile __near unsigned char  *)0x44A)
#define GAFLIDH14H   (*(volatile __near unsigned char  *)0x44B)
#define RMDF110H     (*(volatile __near unsigned char  *)0x44B)
#define GAFLML14     (*(volatile __near unsigned short *)0x44C)
#define RMDF210      (*(volatile __near unsigned short *)0x44C)
#define GAFLML14L    (*(volatile __near unsigned char  *)0x44C)
#define RMDF210L     (*(volatile __near unsigned char  *)0x44C)
#define GAFLML14H    (*(volatile __near unsigned char  *)0x44D)
#define RMDF210H     (*(volatile __near unsigned char  *)0x44D)
#define GAFLMH14     (*(volatile __near unsigned short *)0x44E)
#define RMDF310      (*(volatile __near unsigned short *)0x44E)
#define GAFLMH14L    (*(volatile __near unsigned char  *)0x44E)
#define RMDF310L     (*(volatile __near unsigned char  *)0x44E)
#define GAFLMH14H    (*(volatile __near unsigned char  *)0x44F)
#define RMDF310H     (*(volatile __near unsigned char  *)0x44F)
#define GAFLPL14     (*(volatile __near unsigned short *)0x450)
#define RMIDL11      (*(volatile __near unsigned short *)0x450)
#define GAFLPL14L    (*(volatile __near unsigned char  *)0x450)
#define RMIDL11L     (*(volatile __near unsigned char  *)0x450)
#define GAFLPL14H    (*(volatile __near unsigned char  *)0x451)
#define RMIDL11H     (*(volatile __near unsigned char  *)0x451)
#define GAFLPH14     (*(volatile __near unsigned short *)0x452)
#define RMIDH11      (*(volatile __near unsigned short *)0x452)
#define GAFLPH14L    (*(volatile __near unsigned char  *)0x452)
#define RMIDH11L     (*(volatile __near unsigned char  *)0x452)
#define GAFLPH14H    (*(volatile __near unsigned char  *)0x453)
#define RMIDH11H     (*(volatile __near unsigned char  *)0x453)
#define GAFLIDL15    (*(volatile __near unsigned short *)0x454)
#define RMTS11       (*(volatile __near unsigned short *)0x454)
#define GAFLIDL15L   (*(volatile __near unsigned char  *)0x454)
#define RMTS11L      (*(volatile __near unsigned char  *)0x454)
#define GAFLIDL15H   (*(volatile __near unsigned char  *)0x455)
#define RMTS11H      (*(volatile __near unsigned char  *)0x455)
#define GAFLIDH15    (*(volatile __near unsigned short *)0x456)
#define RMPTR11      (*(volatile __near unsigned short *)0x456)
#define GAFLIDH15L   (*(volatile __near unsigned char  *)0x456)
#define RMPTR11L     (*(volatile __near unsigned char  *)0x456)
#define GAFLIDH15H   (*(volatile __near unsigned char  *)0x457)
#define RMPTR11H     (*(volatile __near unsigned char  *)0x457)
#define GAFLML15     (*(volatile __near unsigned short *)0x458)
#define RMDF011      (*(volatile __near unsigned short *)0x458)
#define GAFLML15L    (*(volatile __near unsigned char  *)0x458)
#define RMDF011L     (*(volatile __near unsigned char  *)0x458)
#define GAFLML15H    (*(volatile __near unsigned char  *)0x459)
#define RMDF011H     (*(volatile __near unsigned char  *)0x459)
#define GAFLMH15     (*(volatile __near unsigned short *)0x45A)
#define RMDF111      (*(volatile __near unsigned short *)0x45A)
#define GAFLMH15L    (*(volatile __near unsigned char  *)0x45A)
#define RMDF111L     (*(volatile __near unsigned char  *)0x45A)
#define GAFLMH15H    (*(volatile __near unsigned char  *)0x45B)
#define RMDF111H     (*(volatile __near unsigned char  *)0x45B)
#define GAFLPL15     (*(volatile __near unsigned short *)0x45C)
#define RMDF211      (*(volatile __near unsigned short *)0x45C)
#define GAFLPL15L    (*(volatile __near unsigned char  *)0x45C)
#define RMDF211L     (*(volatile __near unsigned char  *)0x45C)
#define GAFLPL15H    (*(volatile __near unsigned char  *)0x45D)
#define RMDF211H     (*(volatile __near unsigned char  *)0x45D)
#define GAFLPH15     (*(volatile __near unsigned short *)0x45E)
#define RMDF311      (*(volatile __near unsigned short *)0x45E)
#define GAFLPH15L    (*(volatile __near unsigned char  *)0x45E)
#define RMDF311L     (*(volatile __near unsigned char  *)0x45E)
#define GAFLPH15H    (*(volatile __near unsigned char  *)0x45F)
#define RMDF311H     (*(volatile __near unsigned char  *)0x45F)
#define RMIDL12      (*(volatile __near unsigned short *)0x460)
#define RMIDL12L     (*(volatile __near unsigned char  *)0x460)
#define RMIDL12H     (*(volatile __near unsigned char  *)0x461)
#define RMIDH12      (*(volatile __near unsigned short *)0x462)
#define RMIDH12L     (*(volatile __near unsigned char  *)0x462)
#define RMIDH12H     (*(volatile __near unsigned char  *)0x463)
#define RMTS12       (*(volatile __near unsigned short *)0x464)
#define RMTS12L      (*(volatile __near unsigned char  *)0x464)
#define RMTS12H      (*(volatile __near unsigned char  *)0x465)
#define RMPTR12      (*(volatile __near unsigned short *)0x466)
#define RMPTR12L     (*(volatile __near unsigned char  *)0x466)
#define RMPTR12H     (*(volatile __near unsigned char  *)0x467)
#define RMDF012      (*(volatile __near unsigned short *)0x468)
#define RMDF012L     (*(volatile __near unsigned char  *)0x468)
#define RMDF012H     (*(volatile __near unsigned char  *)0x469)
#define RMDF112      (*(volatile __near unsigned short *)0x46A)
#define RMDF112L     (*(volatile __near unsigned char  *)0x46A)
#define RMDF112H     (*(volatile __near unsigned char  *)0x46B)
#define RMDF212      (*(volatile __near unsigned short *)0x46C)
#define RMDF212L     (*(volatile __near unsigned char  *)0x46C)
#define RMDF212H     (*(volatile __near unsigned char  *)0x46D)
#define RMDF312      (*(volatile __near unsigned short *)0x46E)
#define RMDF312L     (*(volatile __near unsigned char  *)0x46E)
#define RMDF312H     (*(volatile __near unsigned char  *)0x46F)
#define RMIDL13      (*(volatile __near unsigned short *)0x470)
#define RMIDL13L     (*(volatile __near unsigned char  *)0x470)
#define RMIDL13H     (*(volatile __near unsigned char  *)0x471)
#define RMIDH13      (*(volatile __near unsigned short *)0x472)
#define RMIDH13L     (*(volatile __near unsigned char  *)0x472)
#define RMIDH13H     (*(volatile __near unsigned char  *)0x473)
#define RMTS13       (*(volatile __near unsigned short *)0x474)
#define RMTS13L      (*(volatile __near unsigned char  *)0x474)
#define RMTS13H      (*(volatile __near unsigned char  *)0x475)
#define RMPTR13      (*(volatile __near unsigned short *)0x476)
#define RMPTR13L     (*(volatile __near unsigned char  *)0x476)
#define RMPTR13H     (*(volatile __near unsigned char  *)0x477)
#define RMDF013      (*(volatile __near unsigned short *)0x478)
#define RMDF013L     (*(volatile __near unsigned char  *)0x478)
#define RMDF013H     (*(volatile __near unsigned char  *)0x479)
#define RMDF113      (*(volatile __near unsigned short *)0x47A)
#define RMDF113L     (*(volatile __near unsigned char  *)0x47A)
#define RMDF113H     (*(volatile __near unsigned char  *)0x47B)
#define RMDF213      (*(volatile __near unsigned short *)0x47C)
#define RMDF213L     (*(volatile __near unsigned char  *)0x47C)
#define RMDF213H     (*(volatile __near unsigned char  *)0x47D)
#define RMDF313      (*(volatile __near unsigned short *)0x47E)
#define RMDF313L     (*(volatile __near unsigned char  *)0x47E)
#define RMDF313H     (*(volatile __near unsigned char  *)0x47F)
#define RMIDL14      (*(volatile __near unsigned short *)0x480)
#define RMIDL14L     (*(volatile __near unsigned char  *)0x480)
#define RMIDL14H     (*(volatile __near unsigned char  *)0x481)
#define RMIDH14      (*(volatile __near unsigned short *)0x482)
#define RMIDH14L     (*(volatile __near unsigned char  *)0x482)
#define RMIDH14H     (*(volatile __near unsigned char  *)0x483)
#define RMTS14       (*(volatile __near unsigned short *)0x484)
#define RMTS14L      (*(volatile __near unsigned char  *)0x484)
#define RMTS14H      (*(volatile __near unsigned char  *)0x485)
#define RMPTR14      (*(volatile __near unsigned short *)0x486)
#define RMPTR14L     (*(volatile __near unsigned char  *)0x486)
#define RMPTR14H     (*(volatile __near unsigned char  *)0x487)
#define RMDF014      (*(volatile __near unsigned short *)0x488)
#define RMDF014L     (*(volatile __near unsigned char  *)0x488)
#define RMDF014H     (*(volatile __near unsigned char  *)0x489)
#define RMDF114      (*(volatile __near unsigned short *)0x48A)
#define RMDF114L     (*(volatile __near unsigned char  *)0x48A)
#define RMDF114H     (*(volatile __near unsigned char  *)0x48B)
#define RMDF214      (*(volatile __near unsigned short *)0x48C)
#define RMDF214L     (*(volatile __near unsigned char  *)0x48C)
#define RMDF214H     (*(volatile __near unsigned char  *)0x48D)
#define RMDF314      (*(volatile __near unsigned short *)0x48E)
#define RMDF314L     (*(volatile __near unsigned char  *)0x48E)
#define RMDF314H     (*(volatile __near unsigned char  *)0x48F)
#define RMIDL15      (*(volatile __near unsigned short *)0x490)
#define RMIDL15L     (*(volatile __near unsigned char  *)0x490)
#define RMIDL15H     (*(volatile __near unsigned char  *)0x491)
#define RMIDH15      (*(volatile __near unsigned short *)0x492)
#define RMIDH15L     (*(volatile __near unsigned char  *)0x492)
#define RMIDH15H     (*(volatile __near unsigned char  *)0x493)
#define RMTS15       (*(volatile __near unsigned short *)0x494)
#define RMTS15L      (*(volatile __near unsigned char  *)0x494)
#define RMTS15H      (*(volatile __near unsigned char  *)0x495)
#define RMPTR15      (*(volatile __near unsigned short *)0x496)
#define RMPTR15L     (*(volatile __near unsigned char  *)0x496)
#define RMPTR15H     (*(volatile __near unsigned char  *)0x497)
#define RMDF015      (*(volatile __near unsigned short *)0x498)
#define RMDF015L     (*(volatile __near unsigned char  *)0x498)
#define RMDF015H     (*(volatile __near unsigned char  *)0x499)
#define RMDF115      (*(volatile __near unsigned short *)0x49A)
#define RMDF115L     (*(volatile __near unsigned char  *)0x49A)
#define RMDF115H     (*(volatile __near unsigned char  *)0x49B)
#define RMDF215      (*(volatile __near unsigned short *)0x49C)
#define RMDF215L     (*(volatile __near unsigned char  *)0x49C)
#define RMDF215H     (*(volatile __near unsigned char  *)0x49D)
#define RMDF315      (*(volatile __near unsigned short *)0x49E)
#define RMDF315L     (*(volatile __near unsigned char  *)0x49E)
#define RMDF315H     (*(volatile __near unsigned char  *)0x49F)
#define RPGACC0      (*(volatile __near unsigned short *)0x580)
#define RPGACC0L     (*(volatile __near unsigned char  *)0x580)
#define RPGACC0H     (*(volatile __near unsigned char  *)0x581)
#define RPGACC1      (*(volatile __near unsigned short *)0x582)
#define RPGACC1L     (*(volatile __near unsigned char  *)0x582)
#define RPGACC1H     (*(volatile __near unsigned char  *)0x583)
#define RPGACC2      (*(volatile __near unsigned short *)0x584)
#define RPGACC2L     (*(volatile __near unsigned char  *)0x584)
#define RPGACC2H     (*(volatile __near unsigned char  *)0x585)
#define RPGACC3      (*(volatile __near unsigned short *)0x586)
#define RPGACC3L     (*(volatile __near unsigned char  *)0x586)
#define RPGACC3H     (*(volatile __near unsigned char  *)0x587)
#define RPGACC4      (*(volatile __near unsigned short *)0x588)
#define RPGACC4L     (*(volatile __near unsigned char  *)0x588)
#define RPGACC4H     (*(volatile __near unsigned char  *)0x589)
#define RPGACC5      (*(volatile __near unsigned short *)0x58A)
#define RPGACC5L     (*(volatile __near unsigned char  *)0x58A)
#define RPGACC5H     (*(volatile __near unsigned char  *)0x58B)
#define RPGACC6      (*(volatile __near unsigned short *)0x58C)
#define RPGACC6L     (*(volatile __near unsigned char  *)0x58C)
#define RPGACC6H     (*(volatile __near unsigned char  *)0x58D)
#define RPGACC7      (*(volatile __near unsigned short *)0x58E)
#define RPGACC7L     (*(volatile __near unsigned char  *)0x58E)
#define RPGACC7H     (*(volatile __near unsigned char  *)0x58F)
#define RPGACC8      (*(volatile __near unsigned short *)0x590)
#define RPGACC8L     (*(volatile __near unsigned char  *)0x590)
#define RPGACC8H     (*(volatile __near unsigned char  *)0x591)
#define RPGACC9      (*(volatile __near unsigned short *)0x592)
#define RPGACC9L     (*(volatile __near unsigned char  *)0x592)
#define RPGACC9H     (*(volatile __near unsigned char  *)0x593)
#define RPGACC10     (*(volatile __near unsigned short *)0x594)
#define RPGACC10L    (*(volatile __near unsigned char  *)0x594)
#define RPGACC10H    (*(volatile __near unsigned char  *)0x595)
#define RPGACC11     (*(volatile __near unsigned short *)0x596)
#define RPGACC11L    (*(volatile __near unsigned char  *)0x596)
#define RPGACC11H    (*(volatile __near unsigned char  *)0x597)
#define RPGACC12     (*(volatile __near unsigned short *)0x598)
#define RPGACC12L    (*(volatile __near unsigned char  *)0x598)
#define RPGACC12H    (*(volatile __near unsigned char  *)0x599)
#define RPGACC13     (*(volatile __near unsigned short *)0x59A)
#define RPGACC13L    (*(volatile __near unsigned char  *)0x59A)
#define RPGACC13H    (*(volatile __near unsigned char  *)0x59B)
#define RPGACC14     (*(volatile __near unsigned short *)0x59C)
#define RPGACC14L    (*(volatile __near unsigned char  *)0x59C)
#define RPGACC14H    (*(volatile __near unsigned char  *)0x59D)
#define RPGACC15     (*(volatile __near unsigned short *)0x59E)
#define RPGACC15L    (*(volatile __near unsigned char  *)0x59E)
#define RPGACC15H    (*(volatile __near unsigned char  *)0x59F)
#define RFIDL0       (*(volatile __near unsigned short *)0x5A0)
#define RPGACC16     (*(volatile __near unsigned short *)0x5A0)
#define RFIDL0L      (*(volatile __near unsigned char  *)0x5A0)
#define RPGACC16L    (*(volatile __near unsigned char  *)0x5A0)
#define RFIDL0H      (*(volatile __near unsigned char  *)0x5A1)
#define RPGACC16H    (*(volatile __near unsigned char  *)0x5A1)
#define RFIDH0       (*(volatile __near unsigned short *)0x5A2)
#define RPGACC17     (*(volatile __near unsigned short *)0x5A2)
#define RFIDH0L      (*(volatile __near unsigned char  *)0x5A2)
#define RPGACC17L    (*(volatile __near unsigned char  *)0x5A2)
#define RFIDH0H      (*(volatile __near unsigned char  *)0x5A3)
#define RPGACC17H    (*(volatile __near unsigned char  *)0x5A3)
#define RFTS0        (*(volatile __near unsigned short *)0x5A4)
#define RPGACC18     (*(volatile __near unsigned short *)0x5A4)
#define RFTS0L       (*(volatile __near unsigned char  *)0x5A4)
#define RPGACC18L    (*(volatile __near unsigned char  *)0x5A4)
#define RFTS0H       (*(volatile __near unsigned char  *)0x5A5)
#define RPGACC18H    (*(volatile __near unsigned char  *)0x5A5)
#define RFPTR0       (*(volatile __near unsigned short *)0x5A6)
#define RPGACC19     (*(volatile __near unsigned short *)0x5A6)
#define RFPTR0L      (*(volatile __near unsigned char  *)0x5A6)
#define RPGACC19L    (*(volatile __near unsigned char  *)0x5A6)
#define RFPTR0H      (*(volatile __near unsigned char  *)0x5A7)
#define RPGACC19H    (*(volatile __near unsigned char  *)0x5A7)
#define RFDF00       (*(volatile __near unsigned short *)0x5A8)
#define RPGACC20     (*(volatile __near unsigned short *)0x5A8)
#define RFDF00L      (*(volatile __near unsigned char  *)0x5A8)
#define RPGACC20L    (*(volatile __near unsigned char  *)0x5A8)
#define RFDF00H      (*(volatile __near unsigned char  *)0x5A9)
#define RPGACC20H    (*(volatile __near unsigned char  *)0x5A9)
#define RFDF10       (*(volatile __near unsigned short *)0x5AA)
#define RPGACC21     (*(volatile __near unsigned short *)0x5AA)
#define RFDF10L      (*(volatile __near unsigned char  *)0x5AA)
#define RPGACC21L    (*(volatile __near unsigned char  *)0x5AA)
#define RFDF10H      (*(volatile __near unsigned char  *)0x5AB)
#define RPGACC21H    (*(volatile __near unsigned char  *)0x5AB)
#define RFDF20       (*(volatile __near unsigned short *)0x5AC)
#define RPGACC22     (*(volatile __near unsigned short *)0x5AC)
#define RFDF20L      (*(volatile __near unsigned char  *)0x5AC)
#define RPGACC22L    (*(volatile __near unsigned char  *)0x5AC)
#define RFDF20H      (*(volatile __near unsigned char  *)0x5AD)
#define RPGACC22H    (*(volatile __near unsigned char  *)0x5AD)
#define RFDF30       (*(volatile __near unsigned short *)0x5AE)
#define RPGACC23     (*(volatile __near unsigned short *)0x5AE)
#define RFDF30L      (*(volatile __near unsigned char  *)0x5AE)
#define RPGACC23L    (*(volatile __near unsigned char  *)0x5AE)
#define RFDF30H      (*(volatile __near unsigned char  *)0x5AF)
#define RPGACC23H    (*(volatile __near unsigned char  *)0x5AF)
#define RFIDL1       (*(volatile __near unsigned short *)0x5B0)
#define RPGACC24     (*(volatile __near unsigned short *)0x5B0)
#define RFIDL1L      (*(volatile __near unsigned char  *)0x5B0)
#define RPGACC24L    (*(volatile __near unsigned char  *)0x5B0)
#define RFIDL1H      (*(volatile __near unsigned char  *)0x5B1)
#define RPGACC24H    (*(volatile __near unsigned char  *)0x5B1)
#define RFIDH1       (*(volatile __near unsigned short *)0x5B2)
#define RPGACC25     (*(volatile __near unsigned short *)0x5B2)
#define RFIDH1L      (*(volatile __near unsigned char  *)0x5B2)
#define RPGACC25L    (*(volatile __near unsigned char  *)0x5B2)
#define RFIDH1H      (*(volatile __near unsigned char  *)0x5B3)
#define RPGACC25H    (*(volatile __near unsigned char  *)0x5B3)
#define RFTS1        (*(volatile __near unsigned short *)0x5B4)
#define RPGACC26     (*(volatile __near unsigned short *)0x5B4)
#define RFTS1L       (*(volatile __near unsigned char  *)0x5B4)
#define RPGACC26L    (*(volatile __near unsigned char  *)0x5B4)
#define RFTS1H       (*(volatile __near unsigned char  *)0x5B5)
#define RPGACC26H    (*(volatile __near unsigned char  *)0x5B5)
#define RFPTR1       (*(volatile __near unsigned short *)0x5B6)
#define RPGACC27     (*(volatile __near unsigned short *)0x5B6)
#define RFPTR1L      (*(volatile __near unsigned char  *)0x5B6)
#define RPGACC27L    (*(volatile __near unsigned char  *)0x5B6)
#define RFPTR1H      (*(volatile __near unsigned char  *)0x5B7)
#define RPGACC27H    (*(volatile __near unsigned char  *)0x5B7)
#define RFDF01       (*(volatile __near unsigned short *)0x5B8)
#define RPGACC28     (*(volatile __near unsigned short *)0x5B8)
#define RFDF01L      (*(volatile __near unsigned char  *)0x5B8)
#define RPGACC28L    (*(volatile __near unsigned char  *)0x5B8)
#define RFDF01H      (*(volatile __near unsigned char  *)0x5B9)
#define RPGACC28H    (*(volatile __near unsigned char  *)0x5B9)
#define RFDF11       (*(volatile __near unsigned short *)0x5BA)
#define RPGACC29     (*(volatile __near unsigned short *)0x5BA)
#define RFDF11L      (*(volatile __near unsigned char  *)0x5BA)
#define RPGACC29L    (*(volatile __near unsigned char  *)0x5BA)
#define RFDF11H      (*(volatile __near unsigned char  *)0x5BB)
#define RPGACC29H    (*(volatile __near unsigned char  *)0x5BB)
#define RFDF21       (*(volatile __near unsigned short *)0x5BC)
#define RPGACC30     (*(volatile __near unsigned short *)0x5BC)
#define RFDF21L      (*(volatile __near unsigned char  *)0x5BC)
#define RPGACC30L    (*(volatile __near unsigned char  *)0x5BC)
#define RFDF21H      (*(volatile __near unsigned char  *)0x5BD)
#define RPGACC30H    (*(volatile __near unsigned char  *)0x5BD)
#define RFDF31       (*(volatile __near unsigned short *)0x5BE)
#define RPGACC31     (*(volatile __near unsigned short *)0x5BE)
#define RFDF31L      (*(volatile __near unsigned char  *)0x5BE)
#define RPGACC31L    (*(volatile __near unsigned char  *)0x5BE)
#define RFDF31H      (*(volatile __near unsigned char  *)0x5BF)
#define RPGACC31H    (*(volatile __near unsigned char  *)0x5BF)
#define RPGACC32     (*(volatile __near unsigned short *)0x5C0)
#define RPGACC32L    (*(volatile __near unsigned char  *)0x5C0)
#define RPGACC32H    (*(volatile __near unsigned char  *)0x5C1)
#define RPGACC33     (*(volatile __near unsigned short *)0x5C2)
#define RPGACC33L    (*(volatile __near unsigned char  *)0x5C2)
#define RPGACC33H    (*(volatile __near unsigned char  *)0x5C3)
#define RPGACC34     (*(volatile __near unsigned short *)0x5C4)
#define RPGACC34L    (*(volatile __near unsigned char  *)0x5C4)
#define RPGACC34H    (*(volatile __near unsigned char  *)0x5C5)
#define RPGACC35     (*(volatile __near unsigned short *)0x5C6)
#define RPGACC35L    (*(volatile __near unsigned char  *)0x5C6)
#define RPGACC35H    (*(volatile __near unsigned char  *)0x5C7)
#define RPGACC36     (*(volatile __near unsigned short *)0x5C8)
#define RPGACC36L    (*(volatile __near unsigned char  *)0x5C8)
#define RPGACC36H    (*(volatile __near unsigned char  *)0x5C9)
#define RPGACC37     (*(volatile __near unsigned short *)0x5CA)
#define RPGACC37L    (*(volatile __near unsigned char  *)0x5CA)
#define RPGACC37H    (*(volatile __near unsigned char  *)0x5CB)
#define RPGACC38     (*(volatile __near unsigned short *)0x5CC)
#define RPGACC38L    (*(volatile __near unsigned char  *)0x5CC)
#define RPGACC38H    (*(volatile __near unsigned char  *)0x5CD)
#define RPGACC39     (*(volatile __near unsigned short *)0x5CE)
#define RPGACC39L    (*(volatile __near unsigned char  *)0x5CE)
#define RPGACC39H    (*(volatile __near unsigned char  *)0x5CF)
#define RPGACC40     (*(volatile __near unsigned short *)0x5D0)
