imudak/RL78Sample/Can/iodefine.h
#define LBRP0        (*(volatile __near unsigned short *)0x6C2)
#define LBRP00       (*(volatile __near unsigned char  *)0x6C2)
#define LBRP01       (*(volatile __near unsigned char  *)0x6C3)
#define LSTC0        (*(volatile __near unsigned char  *)0x6C4)
#define LUSC0        (*(volatile __near unsigned char  *)0x6C5)
#define LMD0         (*(volatile __near unsigned char  *)0x6C8)
#define LBFC0        (*(volatile __near unsigned char  *)0x6C9)
#define LSC0         (*(volatile __near unsigned char  *)0x6CA)
#define LWUP0        (*(volatile __near unsigned char  *)0x6CB)
#define LIE0         (*(volatile __near unsigned char  *)0x6CC)
#define LEDE0        (*(volatile __near unsigned char  *)0x6CD)
#define LCUC0        (*(volatile __near unsigned char  *)0x6CE)
#define LTRC0        (*(volatile __near unsigned char  *)0x6D0)
#define LMST0        (*(volatile __near unsigned char  *)0x6D1)
#define LST0         (*(volatile __near unsigned char  *)0x6D2)
#define LEST0        (*(volatile __near unsigned char  *)0x6D3)
#define LDFC0        (*(volatile __near unsigned char  *)0x6D4)
#define LIDB0        (*(volatile __near unsigned char  *)0x6D5)
#define LCBR0        (*(volatile __near unsigned char  *)0x6D6)
#define LUDB00       (*(volatile __near unsigned char  *)0x6D7)
#define LDB01        (*(volatile __near unsigned char  *)0x6D8)
#define LDB02        (*(volatile __near unsigned char  *)0x6D9)
#define LDB03        (*(volatile __near unsigned char  *)0x6DA)
#define LDB04        (*(volatile __near unsigned char  *)0x6DB)
#define LDB05        (*(volatile __near unsigned char  *)0x6DC)
#define LDB06        (*(volatile __near unsigned char  *)0x6DD)
#define LDB07        (*(volatile __near unsigned char  *)0x6DE)
#define LDB08        (*(volatile __near unsigned char  *)0x6DF)
#define LUOER0       (*(volatile __near unsigned char  *)0x6E0)
#define LUOR01       (*(volatile __near unsigned char  *)0x6E1)
#define LUTDR0       (*(volatile __near unsigned short *)0x6E4)
#define LUTDR0L      (*(volatile __near unsigned char  *)0x6E4)
#define LUTDR0H      (*(volatile __near unsigned char  *)0x6E5)
#define LURDR0       (*(volatile __near unsigned short *)0x6E6)
#define LURDR0L      (*(volatile __near unsigned char  *)0x6E6)
#define LURDR0H      (*(volatile __near unsigned char  *)0x6E7)
#define LUWTDR0      (*(volatile __near unsigned short *)0x6E8)
#define LUWTDR0L     (*(volatile __near unsigned char  *)0x6E8)
#define LUWTDR0H     (*(volatile __near unsigned char  *)0x6E9)
#define TRJ0         (*(volatile __near unsigned short *)0x6F0)
#define ADTRGS0      (*(volatile __near unsigned char  *)0x789)
#define ADTRGS0_bit  (*(volatile __near __bitf_T *)0x789)
#define ADTRGS1      (*(volatile __near unsigned char  *)0x78D)
#define ADTRGS1_bit  (*(volatile __near __bitf_T *)0x78D)
#define P0           (*(volatile __near unsigned char  *)0xFF00)
#define P0_bit       (*(volatile __near __bitf_T *)0xFF00)
#define P1           (*(volatile __near unsigned char  *)0xFF01)
#define P1_bit       (*(volatile __near __bitf_T *)0xFF01)
#define P3           (*(volatile __near unsigned char  *)0xFF03)
#define P3_bit       (*(volatile __near __bitf_T *)0xFF03)
#define P4           (*(volatile __near unsigned char  *)0xFF04)
#define P4_bit       (*(volatile __near __bitf_T *)0xFF04)
#define P5           (*(volatile __near unsigned char  *)0xFF05)
#define P5_bit       (*(volatile __near __bitf_T *)0xFF05)
#define P6           (*(volatile __near unsigned char  *)0xFF06)
#define P6_bit       (*(volatile __near __bitf_T *)0xFF06)
#define P7           (*(volatile __near unsigned char  *)0xFF07)
#define P7_bit       (*(volatile __near __bitf_T *)0xFF07)
#define P8           (*(volatile __near unsigned char  *)0xFF08)
#define P8_bit       (*(volatile __near __bitf_T *)0xFF08)
#define P9           (*(volatile __near unsigned char  *)0xFF09)
#define P9_bit       (*(volatile __near __bitf_T *)0xFF09)
#define P12          (*(volatile __near unsigned char  *)0xFF0C)
#define P12_bit      (*(volatile __near __bitf_T *)0xFF0C)
#define P13          (*(volatile __near unsigned char  *)0xFF0D)
#define P13_bit      (*(volatile __near __bitf_T *)0xFF0D)
#define P14          (*(volatile __near unsigned char  *)0xFF0E)
#define P14_bit      (*(volatile __near __bitf_T *)0xFF0E)
#define SDR00        (*(volatile __near unsigned short *)0xFF10)
#define SDR00L       (*(volatile __near unsigned char  *)0xFF10)
#define SDR01        (*(volatile __near unsigned short *)0xFF12)
#define SDR01L       (*(volatile __near unsigned char  *)0xFF12)
#define TDR00        (*(volatile __near unsigned short *)0xFF18)
#define TDR01        (*(volatile __near unsigned short *)0xFF1A)
#define TDR01L       (*(volatile __near unsigned char  *)0xFF1A)
#define TDR01H       (*(volatile __near unsigned char  *)0xFF1B)
#define ADCR         (*(volatile __near unsigned short *)0xFF1E)
#define ADCRH        (*(volatile __near unsigned char  *)0xFF1F)
#define PM0          (*(volatile __near unsigned char  *)0xFF20)
#define PM0_bit      (*(volatile __near __bitf_T *)0xFF20)
#define PM1          (*(volatile __near unsigned char  *)0xFF21)
#define PM1_bit      (*(volatile __near __bitf_T *)0xFF21)
#define PM3          (*(volatile __near unsigned char  *)0xFF23)
#define PM3_bit      (*(volatile __near __bitf_T *)0xFF23)
#define PM4          (*(volatile __near unsigned char  *)0xFF24)
#define PM4_bit      (*(volatile __near __bitf_T *)0xFF24)
#define PM5          (*(volatile __near unsigned char  *)0xFF25)
#define PM5_bit      (*(volatile __near __bitf_T *)0xFF25)
#define PM6          (*(volatile __near unsigned char  *)0xFF26)
#define PM6_bit      (*(volatile __near __bitf_T *)0xFF26)
#define PM7          (*(volatile __near unsigned char  *)0xFF27)
#define PM7_bit      (*(volatile __near __bitf_T *)0xFF27)
#define PM8          (*(volatile __near unsigned char  *)0xFF28)
#define PM8_bit      (*(volatile __near __bitf_T *)0xFF28)
#define PM9          (*(volatile __near unsigned char  *)0xFF29)
#define PM9_bit      (*(volatile __near __bitf_T *)0xFF29)
#define PM12         (*(volatile __near unsigned char  *)0xFF2C)
#define PM12_bit     (*(volatile __near __bitf_T *)0xFF2C)
#define PM14         (*(volatile __near unsigned char  *)0xFF2E)
#define PM14_bit     (*(volatile __near __bitf_T *)0xFF2E)
#define ADM0         (*(volatile __near unsigned char  *)0xFF30)
#define ADM0_bit     (*(volatile __near __bitf_T *)0xFF30)
#define ADCE         (((volatile __near __bitf_T *)0xFF30)->no0)
#define ADCS         (((volatile __near __bitf_T *)0xFF30)->no7)
#define ADS          (*(volatile __near unsigned char  *)0xFF31)
#define ADS_bit      (*(volatile __near __bitf_T *)0xFF31)
#define ADM1         (*(volatile __near unsigned char  *)0xFF32)
#define ADM1_bit     (*(volatile __near __bitf_T *)0xFF32)
#define KRM          (*(volatile __near unsigned char  *)0xFF37)
#define KRM_bit      (*(volatile __near __bitf_T *)0xFF37)
#define EGP0         (*(volatile __near unsigned char  *)0xFF38)
#define EGP0_bit     (*(volatile __near __bitf_T *)0xFF38)
#define EGN0         (*(volatile __near unsigned char  *)0xFF39)
#define EGN0_bit     (*(volatile __near __bitf_T *)0xFF39)
#define EGP1         (*(volatile __near unsigned char  *)0xFF3A)
#define EGP1_bit     (*(volatile __near __bitf_T *)0xFF3A)
#define EGN1         (*(volatile __near unsigned char  *)0xFF3B)
#define EGN1_bit     (*(volatile __near __bitf_T *)0xFF3B)
#define SDR10        (*(volatile __near unsigned short *)0xFF48)
#define SDR10L       (*(volatile __near unsigned char  *)0xFF48)
#define SDR11        (*(volatile __near unsigned short *)0xFF4A)
#define SDR11L       (*(volatile __near unsigned char  *)0xFF4A)
#define IICA0        (*(volatile __near unsigned char  *)0xFF50)
#define IICS0        (*(volatile __near unsigned char  *)0xFF51)
#define IICS0_bit    (*(volatile __near __bitf_T *)0xFF51)
#define SPD0         (((volatile __near __bitf_T *)0xFF51)->no0)
#define STD0         (((volatile __near __bitf_T *)0xFF51)->no1)
#define ACKD0        (((volatile __near __bitf_T *)0xFF51)->no2)
#define TRC0         (((volatile __near __bitf_T *)0xFF51)->no3)
#define COI0         (((volatile __near __bitf_T *)0xFF51)->no4)
#define EXC0         (((volatile __near __bitf_T *)0xFF51)->no5)
#define ALD0         (((volatile __near __bitf_T *)0xFF51)->no6)
#define MSTS0        (((volatile __near __bitf_T *)0xFF51)->no7)
#define IICF0        (*(volatile __near unsigned char  *)0xFF52)
#define IICF0_bit    (*(volatile __near __bitf_T *)0xFF52)
#define IICRSV0      (((volatile __near __bitf_T *)0xFF52)->no0)
#define STCEN0       (((volatile __near __bitf_T *)0xFF52)->no1)
#define IICBSY0      (((volatile __near __bitf_T *)0xFF52)->no6)
#define STCF0        (((volatile __near __bitf_T *)0xFF52)->no7)
#define SUBCUDW      (*(volatile __near unsigned short *)0xFF54)
#define TRDGRC0      (*(volatile __near unsigned short *)0xFF58)
#define TRDGRD0      (*(volatile __near unsigned short *)0xFF5A)
#define TRDGRC1      (*(volatile __near unsigned short *)0xFF5C)
#define TRDGRD1      (*(volatile __near unsigned short *)0xFF5E)
#define TDR02        (*(volatile __near unsigned short *)0xFF64)
#define TDR03        (*(volatile __near unsigned short *)0xFF66)
#define TDR03L       (*(volatile __near unsigned char  *)0xFF66)
#define TDR03H       (*(volatile __near unsigned char  *)0xFF67)
#define TDR04        (*(volatile __near unsigned short *)0xFF68)
#define TDR05        (*(volatile __near unsigned short *)0xFF6A)
#define TDR06        (*(volatile __near unsigned short *)0xFF6C)
#define TDR07        (*(volatile __near unsigned short *)0xFF6E)
#define TDR10        (*(volatile __near unsigned short *)0xFF70)
#define TDR11        (*(volatile __near unsigned short *)0xFF72)
#define TDR11L       (*(volatile __near unsigned char  *)0xFF72)
#define TDR11H       (*(volatile __near unsigned char  *)0xFF73)
#define TDR12        (*(volatile __near unsigned short *)0xFF74)
#define TDR13        (*(volatile __near unsigned short *)0xFF76)
#define TDR13L       (*(volatile __near unsigned char  *)0xFF76)
#define TDR13H       (*(volatile __near unsigned char  *)0xFF77)
#define SEC          (*(volatile __near unsigned char  *)0xFF92)
#define MIN          (*(volatile __near unsigned char  *)0xFF93)
#define HOUR         (*(volatile __near unsigned char  *)0xFF94)
#define WEEK         (*(volatile __near unsigned char  *)0xFF95)
#define DAY          (*(volatile __near unsigned char  *)0xFF96)
#define MONTH        (*(volatile __near unsigned char  *)0xFF97)
#define YEAR         (*(volatile __near unsigned char  *)0xFF98)
#define SUBCUD       (*(volatile __near unsigned char  *)0xFF99)
#define ALARMWM      (*(volatile __near unsigned char  *)0xFF9A)
#define ALARMWH      (*(volatile __near unsigned char  *)0xFF9B)
#define ALARMWW      (*(volatile __near unsigned char  *)0xFF9C)
#define RTCC0        (*(volatile __near unsigned char  *)0xFF9D)
#define RTCC0_bit    (*(volatile __near __bitf_T *)0xFF9D)
#define RCLOE1       (((volatile __near __bitf_T *)0xFF9D)->no5)
#define RTCE         (((volatile __near __bitf_T *)0xFF9D)->no7)
#define RTCC1        (*(volatile __near unsigned char  *)0xFF9E)
#define RTCC1_bit    (*(volatile __near __bitf_T *)0xFF9E)
#define RWAIT        (((volatile __near __bitf_T *)0xFF9E)->no0)
#define RWST         (((volatile __near __bitf_T *)0xFF9E)->no1)
#define RIFG         (((volatile __near __bitf_T *)0xFF9E)->no3)
#define WAFG         (((volatile __near __bitf_T *)0xFF9E)->no4)
#define WALIE        (((volatile __near __bitf_T *)0xFF9E)->no6)
#define WALE         (((volatile __near __bitf_T *)0xFF9E)->no7)
#define CMC          (*(volatile __near unsigned char  *)0xFFA0)
#define CSC          (*(volatile __near unsigned char  *)0xFFA1)
#define CSC_bit      (*(volatile __near __bitf_T *)0xFFA1)
#define HIOSTOP      (((volatile __near __bitf_T *)0xFFA1)->no0)
#define XTSTOP       (((volatile __near __bitf_T *)0xFFA1)->no6)
#define MSTOP        (((volatile __near __bitf_T *)0xFFA1)->no7)
#define OSTC         (*(volatile __near unsigned char  *)0xFFA2)
#define OSTC_bit     (*(volatile __near __bitf_T *)0xFFA2)
#define OSTS         (*(volatile __near unsigned char  *)0xFFA3)
#define CKC          (*(volatile __near unsigned char  *)0xFFA4)
#define CKC_bit      (*(volatile __near __bitf_T *)0xFFA4)
#define MCM0         (((volatile __near __bitf_T *)0xFFA4)->no4)
#define MCS          (((volatile __near __bitf_T *)0xFFA4)->no5)
#define CSS          (((volatile __near __bitf_T *)0xFFA4)->no6)
#define CLS          (((volatile __near __bitf_T *)0xFFA4)->no7)
#define CKS0         (*(volatile __near unsigned char  *)0xFFA5)
#define CKS0_bit     (*(volatile __near __bitf_T *)0xFFA5)
#define PCLOE0       (((volatile __near __bitf_T *)0xFFA5)->no7)
#define RESF         (*(volatile __near unsigned char  *)0xFFA8)
#define LVIM         (*(volatile __near unsigned char  *)0xFFA9)
#define LVIM_bit     (*(volatile __near __bitf_T *)0xFFA9)
#define LVIF         (((volatile __near __bitf_T *)0xFFA9)->no0)
#define LVIOMSK      (((volatile __near __bitf_T *)0xFFA9)->no1)
#define LVISEN       (((volatile __near __bitf_T *)0xFFA9)->no7)
#define LVIS         (*(volatile __near unsigned char  *)0xFFAA)
#define LVIS_bit     (*(volatile __near __bitf_T *)0xFFAA)
#define LVILV        (((volatile __near __bitf_T *)0xFFAA)->no0)
#define LVIMD        (((volatile __near __bitf_T *)0xFFAA)->no7)
#define WDTE         (*(volatile __near unsigned char  *)0xFFAB)
#define CRCIN        (*(volatile __near unsigned char  *)0xFFAC)
#define IF2          (*(volatile __near unsigned short *)0xFFD0)
#define IF2L         (*(volatile __near unsigned char  *)0xFFD0)
#define IF2L_bit     (*(volatile __near __bitf_T *)0xFFD0)
#define IF2H         (*(volatile __near unsigned char  *)0xFFD1)
#define IF2H_bit     (*(volatile __near __bitf_T *)0xFFD1)
#define TMIF05       (((volatile __near __bitf_T *)0xFFD0)->no0)
#define TMIF06       (((volatile __near __bitf_T *)0xFFD0)->no1)
#define TMIF07       (((volatile __near __bitf_T *)0xFFD0)->no2)
#define LIN0WUPIF    (((volatile __near __bitf_T *)0xFFD0)->no3)
#define PIF11        (((volatile __near __bitf_T *)0xFFD0)->no3)
#define KRIF         (((volatile __near __bitf_T *)0xFFD0)->no4)
#define CAN0ERRIF    (((volatile __near __bitf_T *)0xFFD0)->no5)
#define CAN0WUPIF    (((volatile __near __bitf_T *)0xFFD0)->no6)
#define CAN0CFRIF    (((volatile __near __bitf_T *)0xFFD0)->no7)
#define CAN0TRMIF    (((volatile __near __bitf_T *)0xFFD1)->no0)
#define CANGRFRIF    (((volatile __near __bitf_T *)0xFFD1)->no1)
#define CANGERRIF    (((volatile __near __bitf_T *)0xFFD1)->no2)
#define TMIF10       (((volatile __near __bitf_T *)0xFFD1)->no3)
#define TMIF11       (((volatile __near __bitf_T *)0xFFD1)->no4)
#define TMIF12       (((volatile __near __bitf_T *)0xFFD1)->no5)
#define TMIF13       (((volatile __near __bitf_T *)0xFFD1)->no6)
#define FLIF         (((volatile __near __bitf_T *)0xFFD1)->no7)
#define MK2          (*(volatile __near unsigned short *)0xFFD4)
#define MK2L         (*(volatile __near unsigned char  *)0xFFD4)
#define MK2L_bit     (*(volatile __near __bitf_T *)0xFFD4)
#define MK2H         (*(volatile __near unsigned char  *)0xFFD5)
#define MK2H_bit     (*(volatile __near __bitf_T *)0xFFD5)
#define TMMK05       (((volatile __near __bitf_T *)0xFFD4)->no0)
#define TMMK06       (((volatile __near __bitf_T *)0xFFD4)->no1)
#define TMMK07       (((volatile __near __bitf_T *)0xFFD4)->no2)
#define LIN0WUPMK    (((volatile __near __bitf_T *)0xFFD4)->no3)
#define PMK11        (((volatile __near __bitf_T *)0xFFD4)->no3)
#define KRMK         (((volatile __near __bitf_T *)0xFFD4)->no4)
#define CAN0ERRMK    (((volatile __near __bitf_T *)0xFFD4)->no5)
#define CAN0WUPMK    (((volatile __near __bitf_T *)0xFFD4)->no6)
#define CAN0CFRMK    (((volatile __near __bitf_T *)0xFFD4)->no7)
#define CAN0TRMMK    (((volatile __near __bitf_T *)0xFFD5)->no0)
#define CANGRFRMK    (((volatile __near __bitf_T *)0xFFD5)->no1)
#define CANGERRMK    (((volatile __near __bitf_T *)0xFFD5)->no2)
#define TMMK10       (((volatile __near __bitf_T *)0xFFD5)->no3)
#define TMMK11       (((volatile __near __bitf_T *)0xFFD5)->no4)
#define TMMK12       (((volatile __near __bitf_T *)0xFFD5)->no5)
#define TMMK13       (((volatile __near __bitf_T *)0xFFD5)->no6)
#define FLMK         (((volatile __near __bitf_T *)0xFFD5)->no7)
#define PR02         (*(volatile __near unsigned short *)0xFFD8)
#define PR02L        (*(volatile __near unsigned char  *)0xFFD8)
#define PR02L_bit    (*(volatile __near __bitf_T *)0xFFD8)
#define PR02H        (*(volatile __near unsigned char  *)0xFFD9)
#define PR02H_bit    (*(volatile __near __bitf_T *)0xFFD9)
#define TMPR005      (((volatile __near __bitf_T *)0xFFD8)->no0)
#define TMPR006      (((volatile __near __bitf_T *)0xFFD8)->no1)
#define TMPR007      (((volatile __near __bitf_T *)0xFFD8)->no2)
#define LIN0WUPPR0   (((volatile __near __bitf_T *)0xFFD8)->no3)
#define PPR011       (((volatile __near __bitf_T *)0xFFD8)->no3)
#define KRPR0        (((volatile __near __bitf_T *)0xFFD8)->no4)
#define CAN0ERRPR0   (((volatile __near __bitf_T *)0xFFD8)->no5)
#define CAN0WUPPR0   (((volatile __near __bitf_T *)0xFFD8)->no6)
#define CAN0CFRPR0   (((volatile __near __bitf_T *)0xFFD8)->no7)
#define CAN0TRMPR0   (((volatile __near __bitf_T *)0xFFD9)->no0)
#define CANGRFRPR0   (((volatile __near __bitf_T *)0xFFD9)->no1)
#define CANGERRPR0   (((volatile __near __bitf_T *)0xFFD9)->no2)
#define TMPR010      (((volatile __near __bitf_T *)0xFFD9)->no3)
#define TMPR011      (((volatile __near __bitf_T *)0xFFD9)->no4)
#define TMPR012      (((volatile __near __bitf_T *)0xFFD9)->no5)
#define TMPR013      (((volatile __near __bitf_T *)0xFFD9)->no6)
#define FLPR0        (((volatile __near __bitf_T *)0xFFD9)->no7)
#define PR12         (*(volatile __near unsigned short *)0xFFDC)
#define PR12L        (*(volatile __near unsigned char  *)0xFFDC)
#define PR12L_bit    (*(volatile __near __bitf_T *)0xFFDC)
#define PR12H        (*(volatile __near unsigned char  *)0xFFDD)
#define PR12H_bit    (*(volatile __near __bitf_T *)0xFFDD)
#define TMPR105      (((volatile __near __bitf_T *)0xFFDC)->no0)
#define TMPR106      (((volatile __near __bitf_T *)0xFFDC)->no1)
#define TMPR107      (((volatile __near __bitf_T *)0xFFDC)->no2)
#define LIN0WUPPR1   (((volatile __near __bitf_T *)0xFFDC)->no3)
#define PPR111       (((volatile __near __bitf_T *)0xFFDC)->no3)
#define KRPR1        (((volatile __near __bitf_T *)0xFFDC)->no4)
#define CAN0ERRPR1   (((volatile __near __bitf_T *)0xFFDC)->no5)
#define CAN0WUPPR1   (((volatile __near __bitf_T *)0xFFDC)->no6)
#define CAN0CFRPR1   (((volatile __near __bitf_T *)0xFFDC)->no7)
#define CAN0TRMPR1   (((volatile __near __bitf_T *)0xFFDD)->no0)
#define CANGRFRPR1   (((volatile __near __bitf_T *)0xFFDD)->no1)
#define CANGERRPR1   (((volatile __near __bitf_T *)0xFFDD)->no2)
#define TMPR110      (((volatile __near __bitf_T *)0xFFDD)->no3)
#define TMPR111      (((volatile __near __bitf_T *)0xFFDD)->no4)
#define TMPR112      (((volatile __near __bitf_T *)0xFFDD)->no5)
#define TMPR113      (((volatile __near __bitf_T *)0xFFDD)->no6)
#define FLPR1        (((volatile __near __bitf_T *)0xFFDD)->no7)
#define IF0          (*(volatile __near unsigned short *)0xFFE0)
#define IF0L         (*(volatile __near unsigned char  *)0xFFE0)
#define IF0L_bit     (*(volatile __near __bitf_T *)0xFFE0)
#define IF0H         (*(volatile __near unsigned char  *)0xFFE1)
#define IF0H_bit     (*(volatile __near __bitf_T *)0xFFE1)
#define WDTIIF       (((volatile __near __bitf_T *)0xFFE0)->no0)
#define LVIIF        (((volatile __near __bitf_T *)0xFFE0)->no1)
#define PIF0         (((volatile __near __bitf_T *)0xFFE0)->no2)
#define PIF1         (((volatile __near __bitf_T *)0xFFE0)->no3)
#define PIF2         (((volatile __near __bitf_T *)0xFFE0)->no4)
#define PIF3         (((volatile __near __bitf_T *)0xFFE0)->no5)
#define PIF4         (((volatile __near __bitf_T *)0xFFE0)->no6)
#define SPMIF        (((volatile __near __bitf_T *)0xFFE0)->no6)
#define PIF5         (((volatile __near __bitf_T *)0xFFE0)->no7)
#define CLMIF        (((volatile __near __bitf_T *)0xFFE1)->no0)
#define CSIIF00      (((volatile __near __bitf_T *)0xFFE1)->no1)
#define IICIF00      (((volatile __near __bitf_T *)0xFFE1)->no1)
#define STIF0        (((volatile __near __bitf_T *)0xFFE1)->no1)
#define CSIIF01      (((volatile __near __bitf_T *)0xFFE1)->no2)
#define IICIF01      (((volatile __near __bitf_T *)0xFFE1)->no2)
#define SRIF0        (((volatile __near __bitf_T *)0xFFE1)->no2)
#define TRDIF0       (((volatile __near __bitf_T *)0xFFE1)->no3)
#define TRDIF1       (((volatile __near __bitf_T *)0xFFE1)->no4)
#define TRJIF0       (((volatile __near __bitf_T *)0xFFE1)->no5)
#define RAMIF        (((volatile __near __bitf_T *)0xFFE1)->no6)
#define LIN0TRMIF    (((volatile __near __bitf_T *)0xFFE1)->no7)
#define IF1          (*(volatile __near unsigned short *)0xFFE2)
#define IF1L         (*(volatile __near unsigned char  *)0xFFE2)
#define IF1L_bit     (*(volatile __near __bitf_T *)0xFFE2)
#define IF1H         (*(volatile __near unsigned char  *)0xFFE3)
#define IF1H_bit     (*(volatile __near __bitf_T *)0xFFE3)
#define LIN0RVCIF    (((volatile __near __bitf_T *)0xFFE2)->no0)
#define LIN0IF       (((volatile __near __bitf_T *)0xFFE2)->no1)
#define LIN0STAIF    (((volatile __near __bitf_T *)0xFFE2)->no1)
#define IICAIF0      (((volatile __near __bitf_T *)0xFFE2)->no2)
#define PIF8         (((volatile __near __bitf_T *)0xFFE2)->no3)
#define RTCIF        (((volatile __near __bitf_T *)0xFFE2)->no3)
#define TMIF00       (((volatile __near __bitf_T *)0xFFE2)->no4)
#define TMIF01       (((volatile __near __bitf_T *)0xFFE2)->no5)
#define TMIF02       (((volatile __near __bitf_T *)0xFFE2)->no6)
#define TMIF03       (((volatile __near __bitf_T *)0xFFE2)->no7)
#define ADIF         (((volatile __near __bitf_T *)0xFFE3)->no0)
#define PIF6         (((volatile __near __bitf_T *)0xFFE3)->no1)
#define TMIF11H      (((volatile __near __bitf_T *)0xFFE3)->no1)
#define PIF7         (((volatile __near __bitf_T *)0xFFE3)->no2)
#define TMIF13H      (((volatile __near __bitf_T *)0xFFE3)->no2)
#define PIF9         (((volatile __near __bitf_T *)0xFFE3)->no3)
#define TMIF01H      (((volatile __near __bitf_T *)0xFFE3)->no3)
#define PIF10        (((volatile __near __bitf_T *)0xFFE3)->no4)
#define TMIF03H      (((volatile __near __bitf_T *)0xFFE3)->no4)
#define CSIIF10      (((volatile __near __bitf_T *)0xFFE3)->no5)
#define IICIF10      (((volatile __near __bitf_T *)0xFFE3)->no5)
#define STIF1        (((volatile __near __bitf_T *)0xFFE3)->no5)
#define CSIIF11      (((volatile __near __bitf_T *)0xFFE3)->no6)
#define IICIF11      (((volatile __near __bitf_T *)0xFFE3)->no6)
#define SRIF1        (((volatile __near __bitf_T *)0xFFE3)->no6)
#define TMIF04       (((volatile __near __bitf_T *)0xFFE3)->no7)
#define MK0          (*(volatile __near unsigned short *)0xFFE4)
#define MK0L         (*(volatile __near unsigned char  *)0xFFE4)
#define MK0L_bit     (*(volatile __near __bitf_T *)0xFFE4)
#define MK0H         (*(volatile __near unsigned char  *)0xFFE5)
#define MK0H_bit     (*(volatile __near __bitf_T *)0xFFE5)
#define WDTIMK       (((volatile __near __bitf_T *)0xFFE4)->no0)
#define LVIMK        (((volatile __near __bitf_T *)0xFFE4)->no1)
#define PMK0         (((volatile __near __bitf_T *)0xFFE4)->no2)
#define PMK1         (((volatile __near __bitf_T *)0xFFE4)->no3)
#define PMK2         (((volatile __near __bitf_T *)0xFFE4)->no4)
#define PMK3         (((volatile __near __bitf_T *)0xFFE4)->no5)
#define PMK4         (((volatile __near __bitf_T *)0xFFE4)->no6)
#define SPMMK        (((volatile __near __bitf_T *)0xFFE4)->no6)
#define PMK5         (((volatile __near __bitf_T *)0xFFE4)->no7)
#define CLMMK        (((volatile __near __bitf_T *)0xFFE5)->no0)
#define CSIMK00      (((volatile __near __bitf_T *)0xFFE5)->no1)
#define IICMK00      (((volatile __near __bitf_T *)0xFFE5)->no1)
