imudak/RL78Sample/Can/iodefine.h
#define STMK0        (((volatile __near __bitf_T *)0xFFE5)->no1)
#define CSIMK01      (((volatile __near __bitf_T *)0xFFE5)->no2)
#define IICMK01      (((volatile __near __bitf_T *)0xFFE5)->no2)
#define SRMK0        (((volatile __near __bitf_T *)0xFFE5)->no2)
#define TRDMK0       (((volatile __near __bitf_T *)0xFFE5)->no3)
#define TRDMK1       (((volatile __near __bitf_T *)0xFFE5)->no4)
#define TRJMK0       (((volatile __near __bitf_T *)0xFFE5)->no5)
#define RAMMK        (((volatile __near __bitf_T *)0xFFE5)->no6)
#define LIN0TRMMK    (((volatile __near __bitf_T *)0xFFE5)->no7)
#define MK1          (*(volatile __near unsigned short *)0xFFE6)
#define MK1L         (*(volatile __near unsigned char  *)0xFFE6)
#define MK1L_bit     (*(volatile __near __bitf_T *)0xFFE6)
#define MK1H         (*(volatile __near unsigned char  *)0xFFE7)
#define MK1H_bit     (*(volatile __near __bitf_T *)0xFFE7)
#define LIN0RVCMK    (((volatile __near __bitf_T *)0xFFE6)->no0)
#define LIN0MK       (((volatile __near __bitf_T *)0xFFE6)->no1)
#define LIN0STAMK    (((volatile __near __bitf_T *)0xFFE6)->no1)
#define IICAMK0      (((volatile __near __bitf_T *)0xFFE6)->no2)
#define PMK8         (((volatile __near __bitf_T *)0xFFE6)->no3)
#define RTCMK        (((volatile __near __bitf_T *)0xFFE6)->no3)
#define TMMK00       (((volatile __near __bitf_T *)0xFFE6)->no4)
#define TMMK01       (((volatile __near __bitf_T *)0xFFE6)->no5)
#define TMMK02       (((volatile __near __bitf_T *)0xFFE6)->no6)
#define TMMK03       (((volatile __near __bitf_T *)0xFFE6)->no7)
#define ADMK         (((volatile __near __bitf_T *)0xFFE7)->no0)
#define PMK6         (((volatile __near __bitf_T *)0xFFE7)->no1)
#define TMMK11H      (((volatile __near __bitf_T *)0xFFE7)->no1)
#define PMK7         (((volatile __near __bitf_T *)0xFFE7)->no2)
#define TMMK13H      (((volatile __near __bitf_T *)0xFFE7)->no2)
#define PMK9         (((volatile __near __bitf_T *)0xFFE7)->no3)
#define TMMK01H      (((volatile __near __bitf_T *)0xFFE7)->no3)
#define PMK10        (((volatile __near __bitf_T *)0xFFE7)->no4)
#define TMMK03H      (((volatile __near __bitf_T *)0xFFE7)->no4)
#define CSIMK10      (((volatile __near __bitf_T *)0xFFE7)->no5)
#define IICMK10      (((volatile __near __bitf_T *)0xFFE7)->no5)
#define STMK1        (((volatile __near __bitf_T *)0xFFE7)->no5)
#define CSIMK11      (((volatile __near __bitf_T *)0xFFE7)->no6)
#define IICMK11      (((volatile __near __bitf_T *)0xFFE7)->no6)
#define SRMK1        (((volatile __near __bitf_T *)0xFFE7)->no6)
#define TMMK04       (((volatile __near __bitf_T *)0xFFE7)->no7)
#define PR00         (*(volatile __near unsigned short *)0xFFE8)
#define PR00L        (*(volatile __near unsigned char  *)0xFFE8)
#define PR00L_bit    (*(volatile __near __bitf_T *)0xFFE8)
#define PR00H        (*(volatile __near unsigned char  *)0xFFE9)
#define PR00H_bit    (*(volatile __near __bitf_T *)0xFFE9)
#define WDTIPR0      (((volatile __near __bitf_T *)0xFFE8)->no0)
#define LVIPR0       (((volatile __near __bitf_T *)0xFFE8)->no1)
#define PPR00        (((volatile __near __bitf_T *)0xFFE8)->no2)
#define PPR01        (((volatile __near __bitf_T *)0xFFE8)->no3)
#define PPR02        (((volatile __near __bitf_T *)0xFFE8)->no4)
#define PPR03        (((volatile __near __bitf_T *)0xFFE8)->no5)
#define PPR04        (((volatile __near __bitf_T *)0xFFE8)->no6)
#define SPMPR0       (((volatile __near __bitf_T *)0xFFE8)->no6)
#define PPR05        (((volatile __near __bitf_T *)0xFFE8)->no7)
#define CLMPR0       (((volatile __near __bitf_T *)0xFFE9)->no0)
#define CSIPR000     (((volatile __near __bitf_T *)0xFFE9)->no1)
#define IICPR000     (((volatile __near __bitf_T *)0xFFE9)->no1)
#define STPR00       (((volatile __near __bitf_T *)0xFFE9)->no1)
#define CSIPR001     (((volatile __near __bitf_T *)0xFFE9)->no2)
#define IICPR001     (((volatile __near __bitf_T *)0xFFE9)->no2)
#define SRPR00       (((volatile __near __bitf_T *)0xFFE9)->no2)
#define TRDPR00      (((volatile __near __bitf_T *)0xFFE9)->no3)
#define TRDPR01      (((volatile __near __bitf_T *)0xFFE9)->no4)
#define TRJPR00      (((volatile __near __bitf_T *)0xFFE9)->no5)
#define RAMPR0       (((volatile __near __bitf_T *)0xFFE9)->no6)
#define LIN0TRMPR0   (((volatile __near __bitf_T *)0xFFE9)->no7)
#define PR01         (*(volatile __near unsigned short *)0xFFEA)
#define PR01L        (*(volatile __near unsigned char  *)0xFFEA)
#define PR01L_bit    (*(volatile __near __bitf_T *)0xFFEA)
#define PR01H        (*(volatile __near unsigned char  *)0xFFEB)
#define PR01H_bit    (*(volatile __near __bitf_T *)0xFFEB)
#define LIN0RVCPR0   (((volatile __near __bitf_T *)0xFFEA)->no0)
#define LIN0PR0      (((volatile __near __bitf_T *)0xFFEA)->no1)
#define LIN0STAPR0   (((volatile __near __bitf_T *)0xFFEA)->no1)
#define IICAPR00     (((volatile __near __bitf_T *)0xFFEA)->no2)
#define PPR08        (((volatile __near __bitf_T *)0xFFEA)->no3)
#define RTCPR0       (((volatile __near __bitf_T *)0xFFEA)->no3)
#define TMPR000      (((volatile __near __bitf_T *)0xFFEA)->no4)
#define TMPR001      (((volatile __near __bitf_T *)0xFFEA)->no5)
#define TMPR002      (((volatile __near __bitf_T *)0xFFEA)->no6)
#define TMPR003      (((volatile __near __bitf_T *)0xFFEA)->no7)
#define ADPR0        (((volatile __near __bitf_T *)0xFFEB)->no0)
#define PPR06        (((volatile __near __bitf_T *)0xFFEB)->no1)
#define TMPR011H     (((volatile __near __bitf_T *)0xFFEB)->no1)
#define PPR07        (((volatile __near __bitf_T *)0xFFEB)->no2)
#define TMPR013H     (((volatile __near __bitf_T *)0xFFEB)->no2)
#define PPR09        (((volatile __near __bitf_T *)0xFFEB)->no3)
#define TMPR001H     (((volatile __near __bitf_T *)0xFFEB)->no3)
#define PPR010       (((volatile __near __bitf_T *)0xFFEB)->no4)
#define TMPR003H     (((volatile __near __bitf_T *)0xFFEB)->no4)
#define CSIPR010     (((volatile __near __bitf_T *)0xFFEB)->no5)
#define IICPR010     (((volatile __near __bitf_T *)0xFFEB)->no5)
#define STPR01       (((volatile __near __bitf_T *)0xFFEB)->no5)
#define CSIPR011     (((volatile __near __bitf_T *)0xFFEB)->no6)
#define IICPR011     (((volatile __near __bitf_T *)0xFFEB)->no6)
#define SRPR01       (((volatile __near __bitf_T *)0xFFEB)->no6)
#define TMPR004      (((volatile __near __bitf_T *)0xFFEB)->no7)
#define PR10         (*(volatile __near unsigned short *)0xFFEC)
#define PR10L        (*(volatile __near unsigned char  *)0xFFEC)
#define PR10L_bit    (*(volatile __near __bitf_T *)0xFFEC)
#define PR10H        (*(volatile __near unsigned char  *)0xFFED)
#define PR10H_bit    (*(volatile __near __bitf_T *)0xFFED)
#define WDTIPR1      (((volatile __near __bitf_T *)0xFFEC)->no0)
#define LVIPR1       (((volatile __near __bitf_T *)0xFFEC)->no1)
#define PPR10        (((volatile __near __bitf_T *)0xFFEC)->no2)
#define PPR11        (((volatile __near __bitf_T *)0xFFEC)->no3)
#define PPR12        (((volatile __near __bitf_T *)0xFFEC)->no4)
#define PPR13        (((volatile __near __bitf_T *)0xFFEC)->no5)
#define PPR14        (((volatile __near __bitf_T *)0xFFEC)->no6)
#define SPMPR1       (((volatile __near __bitf_T *)0xFFEC)->no6)
#define PPR15        (((volatile __near __bitf_T *)0xFFEC)->no7)
#define CLMPR1       (((volatile __near __bitf_T *)0xFFED)->no0)
#define CSIPR100     (((volatile __near __bitf_T *)0xFFED)->no1)
#define IICPR100     (((volatile __near __bitf_T *)0xFFED)->no1)
#define STPR10       (((volatile __near __bitf_T *)0xFFED)->no1)
#define CSIPR101     (((volatile __near __bitf_T *)0xFFED)->no2)
#define IICPR101     (((volatile __near __bitf_T *)0xFFED)->no2)
#define SRPR10       (((volatile __near __bitf_T *)0xFFED)->no2)
#define TRDPR10      (((volatile __near __bitf_T *)0xFFED)->no3)
#define TRDPR11      (((volatile __near __bitf_T *)0xFFED)->no4)
#define TRJPR10      (((volatile __near __bitf_T *)0xFFED)->no5)
#define RAMPR1       (((volatile __near __bitf_T *)0xFFED)->no6)
#define LIN0TRMPR1   (((volatile __near __bitf_T *)0xFFED)->no7)
#define PR11         (*(volatile __near unsigned short *)0xFFEE)
#define PR11L        (*(volatile __near unsigned char  *)0xFFEE)
#define PR11L_bit    (*(volatile __near __bitf_T *)0xFFEE)
#define PR11H        (*(volatile __near unsigned char  *)0xFFEF)
#define PR11H_bit    (*(volatile __near __bitf_T *)0xFFEF)
#define LIN0RVCPR1   (((volatile __near __bitf_T *)0xFFEE)->no0)
#define LIN0PR1      (((volatile __near __bitf_T *)0xFFEE)->no1)
#define LIN0STAPR1   (((volatile __near __bitf_T *)0xFFEE)->no1)
#define IICAPR10     (((volatile __near __bitf_T *)0xFFEE)->no2)
#define PPR18        (((volatile __near __bitf_T *)0xFFEE)->no3)
#define RTCPR1       (((volatile __near __bitf_T *)0xFFEE)->no3)
#define TMPR100      (((volatile __near __bitf_T *)0xFFEE)->no4)
#define TMPR101      (((volatile __near __bitf_T *)0xFFEE)->no5)
#define TMPR102      (((volatile __near __bitf_T *)0xFFEE)->no6)
#define TMPR103      (((volatile __near __bitf_T *)0xFFEE)->no7)
#define ADPR1        (((volatile __near __bitf_T *)0xFFEF)->no0)
#define PPR16        (((volatile __near __bitf_T *)0xFFEF)->no1)
#define TMPR111H     (((volatile __near __bitf_T *)0xFFEF)->no1)
#define PPR17        (((volatile __near __bitf_T *)0xFFEF)->no2)
#define TMPR113H     (((volatile __near __bitf_T *)0xFFEF)->no2)
#define PPR19        (((volatile __near __bitf_T *)0xFFEF)->no3)
#define TMPR101H     (((volatile __near __bitf_T *)0xFFEF)->no3)
#define PPR110       (((volatile __near __bitf_T *)0xFFEF)->no4)
#define TMPR103H     (((volatile __near __bitf_T *)0xFFEF)->no4)
#define CSIPR110     (((volatile __near __bitf_T *)0xFFEF)->no5)
#define IICPR110     (((volatile __near __bitf_T *)0xFFEF)->no5)
#define STPR11       (((volatile __near __bitf_T *)0xFFEF)->no5)
#define CSIPR111     (((volatile __near __bitf_T *)0xFFEF)->no6)
#define IICPR111     (((volatile __near __bitf_T *)0xFFEF)->no6)
#define SRPR11       (((volatile __near __bitf_T *)0xFFEF)->no6)
#define TMPR104      (((volatile __near __bitf_T *)0xFFEF)->no7)
#define MACRL        (*(volatile __near unsigned short *)0xFFF0)
#define MACRH        (*(volatile __near unsigned short *)0xFFF2)
#define PMC          (*(volatile __near unsigned char  *)0xFFFE)
#define PMC_bit      (*(volatile __near __bitf_T *)0xFFFE)
#define MAA          (((volatile __near __bitf_T *)0xFFFE)->no0)


